---
kind: method
id: M:Autodesk.Revit.DB.IFC.ExporterIFC.PopTransform
source: html/004039fe-8364-af98-6a51-7df026ea4fc0.htm
---
# Autodesk.Revit.DB.IFC.ExporterIFC.PopTransform Method

Resets the internal transform of the exporter to process the previously active input element (if any), or
 the default transform if the stack is empty.

## Syntax (C#)
```csharp
public void PopTransform()
```